<template>
	<header class="header">
		<b-row align-v="center" class="justify-content-between">
			<b-col cols="auto">
				<b-link class="header__logo" :to="{name: 'home'}">
					<svg
						xmlns="http://www.w3.org/2000/svg"
						xmlns:xlink="http://www.w3.org/1999/xlink"
						width="135px"
						height="26px"
						viewBox="0 0 135 26"
						version="1.1"
					>
						<g id="Symbols" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
							<g
								id="MainScreen/Header/Logo"
								transform="translate(0.000000, -22.000000)"
								fill-rule="nonzero"
							>
								<g id="LOGO" transform="translate(0.000000, 22.000000)">
									<g id="Group-87">
										<g id="Group-86">
											<path
												d="M7.11314327,8.47452307 L8.48570915,8.47078801 L8.48570915,11.4666575 L7.247698,11.4666575 L7.247698,25 L2,25 L2,6.6666562 C2,4.62222459 2.60551213,3 3.81652058,1.80000439 C5.04994427,0.599999372 6.77675643,0 8.99694122,0 C9.7818544,0 10.5219213,0.0888891156 11.217126,0.266666562 C11.9347618,0.42222271 12.5290426,0.655556148 13,0.966666876 L11.6207902,4.73333501 C11.0152939,4.31109974 10.3088578,4.09998996 9.50152939,4.09998996 C7.90927198,4.09998996 7.11314327,4.96666688 7.11314327,6.69998933 L7.11314327,8.47452307 Z"
												id="Path"
												fill="#FFFFFF"
											/>
											<path
												d="M23.0168606,26 C21.0992601,26 19.3734197,25.5998817 17.8391802,24.7996451 C16.3276972,23.97648 15.1432567,22.8447491 14.285954,21.404291 C13.4286513,19.9638328 13,18.3291284 13,16.5000161 C13,14.6708878 13.4286513,13.0361026 14.285954,11.5956606 C15.1432567,10.1552347 16.3276972,9.03490348 17.8391802,8.23465074 C19.3734197,7.41155025 21.0992601,7 23.0168606,7 C24.9346202,7 26.6491619,7.41155025 28.1608039,8.23465074 C29.6722869,9.03490348 30.8567433,10.1552347 31.7140142,11.5956606 C32.571285,13.0361026 33,14.6708878 33,16.5000161 C33,18.3291284 32.571285,19.9638328 31.7140142,21.404291 C30.8567433,22.8447491 29.6722869,23.97648 28.1608039,24.7996451 C26.6491619,25.5998817 24.9346202,26 23.0168606,26 Z M23.0168606,21.610163 C24.3704796,21.610163 25.4760041,21.1528849 26.333275,20.2383288 C27.2131433,19.3008442 27.653157,18.0547938 27.653157,16.5000161 C27.653157,14.9452546 27.2131433,13.7105877 26.333275,12.7960316 C25.4760041,11.8586116 24.3704796,11.3898855 23.0168606,11.3898855 C21.6632415,11.3898855 20.5465774,11.8586116 19.6667091,12.7960316 C18.7868408,13.7105877 18.3468271,14.9452546 18.3468271,16.5000161 C18.3468271,18.0547938 18.7868408,19.3008442 19.6667091,20.2383288 C20.5465774,21.1528849 21.6632415,21.610163 23.0168606,21.610163 Z"
												id="Shape"
												fill="#FFFFFF"
											/>
											<path
												d="M40.9071467,9.60439316 C41.5218371,8.74725622 42.3452961,8.09890904 43.377214,7.65933611 C44.4311238,7.2197787 45.6386675,7 47,7 L47,11.747251 C46.4291386,11.7032953 46.0448991,11.6813174 45.8472813,11.6813174 C44.3761439,11.6813174 43.2234252,12.098897 42.3891251,12.934056 C41.554825,13.7472372 41.1377524,14.9780135 41.1377524,16.6263693 L41.1377524,25 L36,25 L36,7.26373444 L40.9071467,7.26373444 L40.9071467,9.60439316 Z"
												id="Path"
												fill="#FFFFFF"
											/>
											<path
												d="M59.4398814,21.7130182 C60.3799206,21.7130182 61.2078812,21.5757702 61.924079,21.3014357 C62.6625347,21.0041727 63.3451089,20.5468946 63.9716439,19.9296015 L66.7579801,23.0162284 C65.0570695,25.0053556 62.5730297,26 59.3057028,26 C57.2691879,26 55.4675645,25.5998817 53.9011482,24.7996451 C52.334574,23.97648 51.1260198,22.8447491 50.2756435,21.404291 C49.4252671,19.9638328 49,18.3291284 49,16.5000161 C49,14.6937517 49.4140593,13.0703985 50.2420199,11.6299726 C51.0925541,10.1666667 52.245069,9.03490348 53.6997225,8.23465074 C55.1766338,7.41155025 56.832713,7 58.6678021,7 C60.3909706,7 61.9575447,7.37725439 63.3675246,8.13177933 C64.7773467,8.86342421 65.896238,9.93802764 66.7243565,11.3555896 C67.5747329,12.7503038 68,14.4079529 68,16.3285369 L54.6396039,18.9693499 C55.0200395,19.883906 55.6131088,20.5698231 56.4186537,21.0271012 C57.2467722,21.4843792 58.2539007,21.7130182 59.4398814,21.7130182 Z M58.6678021,11.0469269 C57.3474851,11.0469269 56.2732673,11.4813411 55.4453067,12.3501855 C54.6171881,13.2190138 54.180871,14.4193687 54.1360396,15.9512663 L62.9310497,14.2021616 C62.6849504,13.2418777 62.1813862,12.475937 61.4205148,11.9043394 C60.6596434,11.3327257 59.7420199,11.0469269 58.6678021,11.0469269 Z"
												id="Shape"
												fill="#FFFFFF"
											/>
											<path
												d="M77.1334466,26 C75.5743226,26 74.049999,25.8170565 72.56064,25.4513309 C71.071281,25.0625154 69.8842915,24.5824703 69,24.0108728 L70.8152025,20.1697048 C71.6530388,20.6956069 72.6653695,21.1299564 73.8521948,21.472915 C75.0390201,21.792945 76.2026998,21.9531215 77.3429057,21.9531215 C79.6467913,21.9531215 80.7988162,21.3928267 80.7988162,20.2725601 C80.7988162,19.746658 80.4846276,19.3694682 79.8562504,19.1408292 C79.2278732,18.9121902 78.2621618,18.7177824 76.9589521,18.5577674 C75.4229737,18.3291284 74.1547286,18.0662581 73.1540526,17.768995 C72.1533767,17.471732 71.2805759,16.94583 70.5359784,16.1912889 C69.8145266,15.4368285 69.4538827,14.362209 69.4538827,12.9675109 C69.4538827,11.8014519 69.7912169,10.7725601 70.4662135,9.88086788 C71.1643557,8.96631178 72.1650316,8.25751465 73.4682412,7.75450879 C74.7947606,7.25150293 76.3538846,7 78.1457774,7 C79.4722968,7 80.7871613,7.14861537 82.090371,7.4458461 C83.4168904,7.72021293 84.510641,8.10889928 85.3716228,8.61192129 L83.5564203,12.4187772 C81.9042216,11.5042211 80.100674,11.0469269 78.1457774,11.0469269 C76.9822618,11.0469269 76.109461,11.2069742 75.5277032,11.527085 C74.9459454,11.8471797 74.6550665,12.2587299 74.6550665,12.7617358 C74.6550665,13.3333333 74.9692551,13.7334516 75.5976323,13.9620907 C76.2258454,14.1907297 77.2265213,14.4079529 78.5996601,14.613728 C80.1354744,14.865231 81.3922288,15.1395978 82.369595,15.4368285 C83.3469612,15.7111954 84.1964524,16.2256816 84.9179043,16.9802227 C85.6393561,17.7346023 86,18.7864064 86,20.1353121 C86,21.2785072 85.651011,22.2960801 84.9528688,23.1877077 C84.2545625,24.0794968 83.230741,24.7767166 81.8809119,25.2798517 C80.5543925,25.7598967 78.9719588,26 77.1334466,26 Z"
												id="Path"
												fill="#FFFFFF"
											/>
											<path
												d="M97.9813986,26 C96.073832,26 94.3548003,25.5998817 92.8243035,24.7996451 C91.3160242,23.97648 90.1292712,22.8447491 89.264201,21.404291 C88.4213482,19.9638328 88,18.3291284 88,16.5000161 C88,14.6708878 88.4213482,13.0361026 89.264201,11.5956606 C90.1292712,10.1552347 91.3160242,9.03490348 92.8243035,8.23465074 C94.3548003,7.41155025 96.073832,7 97.9813986,7 C99.8669043,7 101.508332,7.41155025 102.90568,8.23465074 C104.325247,9.03490348 105.356634,10.1895306 106,11.6985643 L101.974114,13.9277948 C101.042392,12.235866 99.7004303,11.3898855 97.948229,11.3898855 C96.5951584,11.3898855 95.4750576,11.8471797 94.58777,12.7617358 C93.7004824,13.6762919 93.2569169,14.9223907 93.2569169,16.5000161 C93.2569169,18.0775608 93.7004824,19.3237727 94.58777,20.2383288 C95.4750576,21.1528849 96.5951584,21.610163 97.948229,21.610163 C99.7226477,21.610163 101.06461,20.7640694 101.974114,19.0722052 L106,21.335667 C105.356634,22.7990536 104.325247,23.9422488 102.90568,24.7654138 C101.508332,25.5884175 99.8669043,26 97.9813986,26 Z"
												id="Path"
												fill="#FFFFFF"
											/>
											<path
												d="M117.016869,26 C115.09927,26 113.373431,25.5998817 111.839351,24.7996451 C110.32771,23.97648 109.143255,22.8447491 108.285985,21.404291 C107.428715,19.9638328 107,18.3291284 107,16.5000161 C107,14.6708878 107.428715,13.0361026 108.285985,11.5956606 C109.143255,10.1552347 110.32771,9.03490348 111.839351,8.23465074 C113.373431,7.41155025 115.09927,7 117.016869,7 C118.934627,7 120.649167,7.41155025 122.160808,8.23465074 C123.67229,9.03490348 124.856745,10.1552347 125.714015,11.5956606 C126.571285,13.0361026 127,14.6708878 127,16.5000161 C127,18.3291284 126.571285,19.9638328 125.714015,21.404291 C124.856745,22.8447491 123.67229,23.97648 122.160808,24.7996451 C120.649167,25.5998817 118.934627,26 117.016869,26 Z M117.016869,21.610163 C118.370486,21.610163 119.47601,21.1528849 120.33328,20.2383288 C121.213148,19.3008442 121.653161,18.0547938 121.653161,16.5000161 C121.653161,14.9452546 121.213148,13.7105877 120.33328,12.7960316 C119.47601,11.8586116 118.370486,11.3898855 117.016869,11.3898855 C115.663251,11.3898855 114.546587,11.8586116 113.66672,12.7960316 C112.786852,13.7105877 112.346839,14.9452546 112.346839,16.5000161 C112.346839,18.0547938 112.786852,19.3008442 113.66672,20.2383288 C114.546587,21.1528849 115.663251,21.610163 117.016869,21.610163 Z"
												id="Shape"
												fill="#FFFFFF"
											/>
											<path
												d="M132.5,26 C131.795434,26 131.202651,25.7594993 130.721649,25.2783505 C130.240501,24.797349 130,24.1958763 130,23.4742268 C130,22.7354934 130.240501,22.1427099 130.721649,21.6958763 C131.202651,21.2319588 131.795434,21 132.5,21 C133.204418,21 133.797202,21.2319588 134.278351,21.6958763 C134.759352,22.1427099 135,22.7354934 135,23.4742268 C135,24.1958763 134.759352,24.797349 134.278351,25.2783505 C133.797202,25.7594993 133.204418,26 132.5,26 Z"
												id="Path"
												fill="#FF4E4E"
											/>
											<polygon id="Path" fill="#FFFFFF" points="0 13 4.87216714e-08 8 11 8 11 13" />
										</g>
									</g>
								</g>
							</g>
						</g>
					</svg>
				</b-link>
			</b-col>
			<b-col cols="auto">
				<div
					class="header__burger"
					:class="{'active': isMenuOpened}"
					@click="isMenuOpened = !isMenuOpened"
				/>
			</b-col>
		</b-row>
		<transition name="menu">
			<div class="menu" v-if="isMenuOpened">
				<ul :class="{'menu-links': isMenuOpened}">
					<div class="indicator">
						<div
							class="indicator__inner"
							:style="`height: ${indicatorHeight}; background-color: ${indicatorColor}`"
						/>
					</div>

					<li
						v-for="(item, index) in menuLinks"
						:key="index"
						:class="{'active': index===indicatorActive}"
						@mouseover="test(index, $event), indicatorColor=item.color, indicatorActive=index"
						@click="test2(index)"
					>{{ item.title }}</li>
				</ul>

				<div class="glow" />
				<StarsParticles />
			</div>
		</transition>
	</header>
</template>

<script>
import StarsParticles from "@/components/elements/StarsParticles";

export default {
	name: "Headerlayout",
	components: {
		StarsParticles
	},
	data: () => ({
		burgerActive: false,
		indicatorHeight: null,
		indicatorColor: null,
		indicatorActive: 0,
		menuLinks: [
			{
				title: "проекты",
				color: "rgba(55, 119, 255, 0.75)"
			},
			{
				title: "о нас",
				color: "rgba(255, 167, 56)"
			},
			{
				title: "команда",
				color: "rgba(96, 224, 135)"
			},
			{
				title: "контакты",
				color: "rgba(62, 219, 237)"
			}
		]
	}),
	computed: {
		isMenuOpened: {
			get: function() {
				return this.$store.state.isHeaderMenuOpened;
			},
			set: function(newValue) {
				this.$store.state.isHeaderMenuOpened = newValue;
			}
		}
	},
	methods: {
		test(index, e) {
			if (index == this.menuLinks.length - 1) {
				this.indicatorHeight = "100%";
			} else {
				this.indicatorHeight = `${e.target.offsetTop +
					e.target.offsetHeight}px`;
			}
		},
		test2(e) {
			console.log(e);
		}
	},
	watch: {
		isMenuOpened() {
			if (this.isMenuOpened) {
				document.documentElement.classList.add("locked");
				return;
			}
			//document.documentElement.classList.remove('locked');
			setTimeout(
				() => document.documentElement.classList.remove("locked"),
				500
			);
			//document.documentElement.classList.remove('locked');
		}
	}
};
</script>

<style lang="scss">
.header {
	padding: 0 $gutter;
	position: absolute;
	top: 0;
	left: 0;
	width: 100%;
	z-index: 3;
	height: 50px;

	.row {
		height: 100%;
	}

	&__burger {
		width: 28px;
		height: 20px;
		position: relative;
		cursor: pointer;

		&::before,
		&::after {
			position: absolute;
			left: 0;
			content: "";
			display: block;
			width: 100%;
			height: 3px;
			background: $white;
			transform-origin: left;
		}

		&::before {
			top: 0;
		}

		&::after {
			bottom: 0;
		}

		&.active {
			&::before {
				transform: rotate(45deg);
				top: -1px;
			}

			&::after {
				transform: rotate(-45deg);
				bottom: -1px;
			}
		}
	}

	@include up($md) {
		padding: 0 $gutter-sm;
		height: 70px;
	}
}

.menu {
	position: fixed;
	top: 0;
	right: 0;
	width: 100%;
	height: 100vh;
	z-index: -1;
	background: $black;
	padding: 50px $gutter;

	.indicator {
		width: 1px;
		height: 100%;
		position: absolute;
		top: 0;
		left: 0;
		background: rgba(255, 255, 255, 0.3);

		&__inner {
			position: absolute;
			top: 0;
			left: 0;
			width: 100%;
			height: 100px;
			background-color: rgba(55, 119, 255, 0.75);
			transition: height background 0.3s ease-in-out;
			transition: height, background-color, 0.4s ease;
		}
	}

	ul {
		position: relative;
		z-index: 1;
		transform: translateX(20%);
		opacity: 0;
		padding: 0;
		margin: 0;
		max-width: 730px;
		height: calc(100% - 110px);
		padding-left: $gutter-sm;
		margin-top: $gutter-md;
		margin-left: auto;
		position: relative;
		display: flex;
		flex-flow: column;
		justify-content: center;
		font-family: TT Norms;
		font-size: 37px;
		line-height: normal;
		transition: max-width, font-size, margin, height, padding-left, $transition;

		li {
			padding: $gutter 0;
			cursor: pointer;
			color: rgba(255, 255, 255, 0.28);
			transition: color $transition;
			margin-bottom: 0;

			&.active,
			&:hover {
				color: $white;
			}

			&::before {
				display: none;
			}

			&:last-child {
			}
		}

		&.menu-links {
			animation: menu-links 0.8s forwards ease;
			animation-delay: 0.4s;
		}

		@include up($sm) {
			font-size: 55px;
			padding-left: $gutter-md;
			margin-top: $gutter-lg;
			height: calc(100% - 140px);
		}

		@include up($md) {
			max-width: 450px;
			padding-left: $gutter-lg;
		}

		@include up($lg) {
			max-width: 550px;
			font-size: 85px;
		}

		@include up($xl) {
			max-width: 700px;
		}
	}

	.glow {
		position: absolute;
		top: 50%;
		left: 35%;
		opacity: 0.2;
		transform: translate(-50%, -50%);
		background: radial-gradient(circle closest-side, #3779bccc, #0067de00 73%);
		width: 400%;
		z-index: -1;
		animation: test 5s infinite ease-in-out;
		pointer-events: none;

		&::after {
			content: "";
			display: block;
			width: 100%;
			padding-top: 100%;
		}

		@include up($sm) {
			width: 200%;
		}

		@include up($md) {
			width: 150%;
			left: 85%;
		}

		@include up($lg) {
			width: 100%;
			left: 65%;
		}

		@include up($xl) {
			width: 90%;
			left: 35%;
		}
	}

	.stars-particles {
		position: absolute;
		top: 0;
		left: 0;
		width: 100%;
		height: 100%;
	}

	&-enter-active,
	&-leave-active {
		transition: 0.3s ease-in-out;
		opacity: 1;

		ul {
		}
	}

	&-enter,
	&-leave-to {
		transition: 0.3s ease-in-out;
		opacity: 0;

		ul {
			//animation: menu-links 1s forwards ease;
		}
	}

	@include up($md) {
		padding: 70px $gutter-sm;
		height: 100%;
	}
}

@keyframes test {
	from {
		transform: translate(-50%, -50%) skew(-30deg, 10deg);
	}

	50% {
		transform: translate(-50%, -50%) skew(-14deg, 10deg);
		opacity: 0.4;
	}

	75% {
		transform: translate(-50%, -50%) skew(-30deg, 10deg);
	}

	to {
		transform: translate(-50%, -50%) skew(-30deg, 10deg);
	}
}

@keyframes menu-links {
	from {
		transform: translateX(100px);
		opacity: 0;
	}

	to {
		transform: translateX(0);
		opacity: 1;
	}
}
</style>